app/Http/Controllers/UserController.php

    public function index(Request $request)
    {

        $users = User::orderBy('id')
                ->filter(RequestStatic::only('search', 'trashed'))
                ->paginate(5)
                ->withQueryString();
---
select * from `users` where `users`.`deleted_at` is null order by `id` asc limit 5 offset 0
select count(*) as aggregate from `users` where `users`.`deleted_at` is null